Ran Plan for 14 projects:

1. dir: `terragrunt/production/instances/instance-awx` workspace: `default`
1. dir: `terragrunt/production/instances/instance-fire-agent` workspace: `default`
1. dir: `terragrunt/production/instances/instance-jenkins` workspace: `default`
1. dir: `terragrunt/production/instances/instance-mariadb` workspace: `default`
1. dir: `terragrunt/production/instances/instance-sandbox-agent` workspace: `default`
1. dir: `terragrunt/production/instances` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-awx` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-jenkins` workspace: `default`
1. dir: `terragrunt/production/vpc-networks/static-ip-mariadb` workspace: `default`
1. dir: `terragrunt/production/vpc-networks` workspace: `default`
1. dir: `terragrunt/staging/instances/instance-mariadb` workspace: `default`
1. dir: `terragrunt/staging/instances` workspace: `default`

### 1. dir: `terragrunt/production/instances/instance-awx` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:17:14Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-awx] 
time=2023-12-17T07:17:14Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-awx] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_compute_address.external_static_ip: Reading...
data.google_compute_address.external_static_ip: Read complete after 0s [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-awx]
google_compute_instance.default: Refreshing state... [id=projects/fundhub-408000/zones/asia-southeast2-a/instances/instance-awx]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/instances/instance-awx`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Finstances%252Finstance-awx%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/instances/instance-awx`
</details>
No changes. Your infrastructure matches the configuration.

---
### 2. dir: `terragrunt/production/instances/instance-fire-agent` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:17:20Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-fire-agent] 
time=2023-12-17T07:17:20Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-fire-agent] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_compute_address.external_static_ip: Reading...
data.google_compute_address.external_static_ip: Read complete after 1s [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-jenkins-agent-fire]
google_compute_instance.default: Refreshing state... [id=projects/fundhub-408000/zones/asia-southeast2-a/instances/instance-fire-agent]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/instances/instance-fire-agent`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Finstances%252Finstance-fire-agent%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/instances/instance-fire-agent`
</details>
No changes. Your infrastructure matches the configuration.

---
### 3. dir: `terragrunt/production/instances/instance-jenkins` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:17:26Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-jenkins] 
time=2023-12-17T07:17:26Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-jenkins] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_compute_address.external_static_ip: Reading...
data.google_compute_address.external_static_ip: Read complete after 0s [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-jenkins]
google_compute_instance.default: Refreshing state... [id=projects/fundhub-408000/zones/asia-southeast2-a/instances/instance-jenkins]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/instances/instance-jenkins`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Finstances%252Finstance-jenkins%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/instances/instance-jenkins`
</details>
No changes. Your infrastructure matches the configuration.

---
### 4. dir: `terragrunt/production/instances/instance-mariadb` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:17:31Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-mariadb] 
time=2023-12-17T07:17:31Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-mariadb] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_compute_address.external_static_ip: Reading...
data.google_compute_address.external_static_ip: Read complete after 0s [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-mariadb]
google_compute_instance.default: Refreshing state... [id=projects/fundhub-408000/zones/asia-southeast2-a/instances/instance-mariadb]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/instances/instance-mariadb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Finstances%252Finstance-mariadb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/instances/instance-mariadb`
</details>
No changes. Your infrastructure matches the configuration.

---
### 5. dir: `terragrunt/production/instances/instance-sandbox-agent` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:17:38Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-sandbox-agent] 
time=2023-12-17T07:17:38Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-sandbox-agent] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_compute_address.external_static_ip: Reading...
data.google_compute_address.external_static_ip: Read complete after 1s [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-jenkins-agent-sandbox]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = (known after apply)
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-small"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "instance-sandbox-agent"
      + project              = "fundhub-408000"
      + self_link            = (known after apply)
      + tags                 = [
          + "allow-specific-port",
        ]
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = (known after apply)
      + zone                 = "asia-southeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels = (known after apply)
              + size   = 10
              + type   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "default"
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = "34.101.199.35"
              + network_tier = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_ip = (known after apply)
  + public_ip  = "34.101.199.35"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-sandbox-agent/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances/instance-sandbox-agent/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/instances/instance-sandbox-agent`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Finstances%252Finstance-sandbox-agent%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/instances/instance-sandbox-agent`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 6. dir: `terragrunt/production/instances` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances": 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2023-12-17T07:17:44Z level=error msg=terraform invocation failed in /root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances
time=2023-12-17T07:17:44Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/instances] exit status 1



time=2023-12-17T07:17:43Z level=warning msg=The following inputs passed in by terragrunt are unused:

time=2023-12-17T07:17:43Z level=warning msg=	- network
time=2023-12-17T07:17:43Z level=warning msg=	- project_id
time=2023-12-17T07:17:43Z level=warning msg=	- region
time=2023-12-17T07:17:43Z level=warning msg=	- sub_network
time=2023-12-17T07:17:43Z level=warning msg=	- zone
time=2023-12-17T07:17:43Z level=warning msg=	- credentials
time=2023-12-17T07:17:43Z level=warning msg=	- name
time=2023-12-17T07:17:43Z level=warning
time=2023-12-17T07:17:43Z level=info msg=All required inputs are passed in by terragrunt
time=2023-12-17T07:17:43Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring.

```
</details>

---
### 7. dir: `terragrunt/production/vpc-networks/static-ip-awx` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:17:45Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-awx] 
time=2023-12-17T07:17:45Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-awx] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
google_compute_address.static_ip: Refreshing state... [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-awx]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-awx`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-awx%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-awx`
</details>
No changes. Your infrastructure matches the configuration.

---
### 8. dir: `terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:17:50Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire] 
time=2023-12-17T07:17:50Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
google_compute_address.static_ip: Refreshing state... [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-jenkins-agent-fire]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-jenkins-agent-fire%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-jenkins-agent-fire`
</details>
No changes. Your infrastructure matches the configuration.

---
### 9. dir: `terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:17:55Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox] 
time=2023-12-17T07:17:55Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
google_compute_address.static_ip: Refreshing state... [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-jenkins-agent-sandbox]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-jenkins-agent-sandbox%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-jenkins-agent-sandbox`
</details>
No changes. Your infrastructure matches the configuration.

---
### 10. dir: `terragrunt/production/vpc-networks/static-ip-jenkins` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:18:01Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-jenkins] 
time=2023-12-17T07:18:01Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-jenkins] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
google_compute_address.static_ip: Refreshing state... [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-jenkins]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-jenkins`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-jenkins%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-jenkins`
</details>
No changes. Your infrastructure matches the configuration.

---
### 11. dir: `terragrunt/production/vpc-networks/static-ip-mariadb` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:18:06Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-mariadb] 
time=2023-12-17T07:18:06Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks/static-ip-mariadb] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
google_compute_address.static_ip: Refreshing state... [id=projects/fundhub-408000/regions/asia-southeast2/addresses/static-ip-mariadb]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/production/vpc-networks/static-ip-mariadb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fproduction%252Fvpc-networks%252Fstatic-ip-mariadb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/production/vpc-networks/static-ip-mariadb`
</details>
No changes. Your infrastructure matches the configuration.

---
### 12. dir: `terragrunt/production/vpc-networks` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks": 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2023-12-17T07:18:12Z level=error msg=terraform invocation failed in /root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks
time=2023-12-17T07:18:12Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/production/vpc-networks] exit status 1



time=2023-12-17T07:18:12Z level=warning msg=The following inputs passed in by terragrunt are unused:

time=2023-12-17T07:18:12Z level=warning msg=	- name
time=2023-12-17T07:18:12Z level=warning msg=	- project_id
time=2023-12-17T07:18:12Z level=warning msg=	- region
time=2023-12-17T07:18:12Z level=warning msg=	- zone
time=2023-12-17T07:18:12Z level=warning msg=	- address_type
time=2023-12-17T07:18:12Z level=warning msg=	- credentials
time=2023-12-17T07:18:12Z level=warning
time=2023-12-17T07:18:12Z level=info msg=All required inputs are passed in by terragrunt
time=2023-12-17T07:18:12Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring.

```
</details>

---
### 13. dir: `terragrunt/staging/instances/instance-mariadb` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-12-17T07:18:13Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/staging/instances/instance-mariadb] 
time=2023-12-17T07:18:13Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/staging/instances/instance-mariadb] 


Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.9.0"...
- Installing hashicorp/google v5.9.0...
- Installed hashicorp/google v5.9.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.google_compute_address.external_static_ip: Reading...
data.google_compute_address.external_static_ip: Read complete after 1s [id=projects/fundhub-staging/regions/asia-southeast2/addresses/static-ip-mariadb]
google_compute_instance.default: Refreshing state... [id=projects/fundhub-staging/zones/asia-southeast2-a/instances/instance-mariadb]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terragrunt/staging/instances/instance-mariadb`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.128.65.188/lock?id=titan2903%252Ffundhub-terraform-config%252Fterragrunt%252Fstaging%252Finstances%252Finstance-mariadb%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terragrunt/staging/instances/instance-mariadb`
</details>
No changes. Your infrastructure matches the configuration.

---
### 14. dir: `terragrunt/staging/instances` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/staging/instances": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/staging/instances": 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2023-12-17T07:18:20Z level=error msg=terraform invocation failed in /root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/staging/instances
time=2023-12-17T07:18:20Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/titan2903/fundhub-terraform-config/4/default/terragrunt/staging/instances] exit status 1



time=2023-12-17T07:18:19Z level=warning msg=The following inputs passed in by terragrunt are unused:

time=2023-12-17T07:18:19Z level=warning msg=	- credentials
time=2023-12-17T07:18:19Z level=warning msg=	- name
time=2023-12-17T07:18:19Z level=warning msg=	- network
time=2023-12-17T07:18:19Z level=warning msg=	- project_id
time=2023-12-17T07:18:19Z level=warning msg=	- region
time=2023-12-17T07:18:19Z level=warning msg=	- sub_network
time=2023-12-17T07:18:19Z level=warning msg=	- zone
time=2023-12-17T07:18:19Z level=warning
time=2023-12-17T07:18:19Z level=info msg=All required inputs are passed in by terragrunt
time=2023-12-17T07:18:19Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring.

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`